#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.apis.google_project_service.cloud_logging will be created
  + resource "google_project_service" "cloud_logging" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "vmy-etl-prod"
      + service            = "logging.googleapis.com"
    }

  # module.apis.google_project_service.composer_api will be created
  + resource "google_project_service" "composer_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "vmy-etl-prod"
      + service            = "composer.googleapis.com"
    }

  # module.apis.google_project_service.compute will be created
  + resource "google_project_service" "compute" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "vmy-etl-prod"
      + service            = "compute.googleapis.com"
    }

  # module.apis.google_project_service.service-bigquery will be created
  + resource "google_project_service" "service-bigquery" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "vmy-etl-prod"
      + service            = "bigquery.googleapis.com"
    }

  # module.apis.google_project_service.service-bigquerydatatransfer will be created
  + resource "google_project_service" "service-bigquerydatatransfer" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "vmy-etl-prod"
      + service            = "bigquerydatatransfer.googleapis.com"
    }

  # module.apis.google_project_service.service-bigquerystorage will be created
  + resource "google_project_service" "service-bigquerystorage" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "vmy-etl-prod"
      + service            = "bigquerystorage.googleapis.com"
    }

  # module.apis.google_project_service.service-secretmanager will be created
  + resource "google_project_service" "service-secretmanager" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "vmy-etl-prod"
      + service            = "secretmanager.googleapis.com"
    }

  # module.apis.google_project_service.service-servicemanagement will be created
  + resource "google_project_service" "service-servicemanagement" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "vmy-etl-prod"
      + service            = "servicemanagement.googleapis.com"
    }

  # module.bigquery.google_bigquery_dataset.airflow will be created
  + resource "google_bigquery_dataset" "airflow" {
      + creation_time              = (known after apply)
      + dataset_id                 = "chicago"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = true
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "EU"
      + max_time_travel_hours      = (known after apply)
      + project                    = "vmy-etl-prod"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + iam_member     = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + dataset {
              + target_types = (known after apply)

              + dataset {
                  + dataset_id = (known after apply)
                  + project_id = (known after apply)
                }
            }

          + routine {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + routine_id = (known after apply)
            }

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.composer.google_composer_environment.airflow will be created
  + resource "google_composer_environment" "airflow" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = "crime"
      + project          = "vmy-etl-prod"
      + region           = "europe-west1"
      + terraform_labels = (known after apply)

      + config {
          + airflow_uri      = (known after apply)
          + dag_gcs_prefix   = (known after apply)
          + environment_size = "ENVIRONMENT_SIZE_SMALL"
          + gke_cluster      = (known after apply)
          + node_count       = 2
          + resilience_mode  = (known after apply)

          + database_config {
              + machine_type = (known after apply)
            }

          + encryption_config {
              + kms_key_name = (known after apply)
            }

          + maintenance_window {
              + end_time   = (known after apply)
              + recurrence = (known after apply)
              + start_time = (known after apply)
            }

          + node_config {
              + disk_size_gb         = 20
              + enable_ip_masq_agent = (known after apply)
              + ip_allocation_policy = (known after apply)
              + machine_type         = "n1-standard-1"
              + network              = "default"
              + oauth_scopes         = (known after apply)
              + service_account      = (known after apply)
              + subnetwork           = "default"
              + zone                 = "europe-west1-c"
            }

          + private_environment_config {
              + cloud_composer_connection_subnetwork   = (known after apply)
              + cloud_composer_network_ipv4_cidr_block = (known after apply)
              + cloud_sql_ipv4_cidr_block              = (known after apply)
              + connection_type                        = (known after apply)
              + enable_private_endpoint                = (known after apply)
              + enable_privately_used_public_ips       = (known after apply)
              + master_ipv4_cidr_block                 = (known after apply)
              + web_server_ipv4_cidr_block             = (known after apply)
            }

          + software_config {
              + airflow_config_overrides = {
                  + "core-dags_are_paused_at_creation" = "True"
                }
              + env_variables            = {
                  + "DBT_PROFILES_DIR" = "/home/airflow/gcs/data/profiles"
                }
              + image_version            = "composer-1.20.12-airflow-2.4.3"
              + pypi_packages            = {
                  + "airflow-dbt"  = ""
                  + "dbt-bigquery" = ""
                }
              + python_version           = "3"
              + scheduler_count          = (known after apply)
            }

          + web_server_config {
              + machine_type = (known after apply)
            }

          + web_server_network_access_control {
              + allowed_ip_range {
                  + description = (known after apply)
                  + value       = (known after apply)
                }
            }

          + workloads_config {
              + scheduler {
                  + count      = (known after apply)
                  + cpu        = (known after apply)
                  + memory_gb  = (known after apply)
                  + storage_gb = (known after apply)
                }

              + triggerer {
                  + count     = (known after apply)
                  + cpu       = (known after apply)
                  + memory_gb = (known after apply)
                }

              + web_server {
                  + cpu        = (known after apply)
                  + memory_gb  = (known after apply)
                  + storage_gb = (known after apply)
                }

              + worker {
                  + cpu        = (known after apply)
                  + max_count  = (known after apply)
                  + memory_gb  = (known after apply)
                  + min_count  = (known after apply)
                  + storage_gb = (known after apply)
                }
            }
        }

      + storage_config {
          + bucket = (known after apply)
        }
    }

  # module.gh_oidc.google_iam_workload_identity_pool.main will be created
  + resource "google_iam_workload_identity_pool" "main" {
      + description               = "Workload Identity Pool managed by Terraform"
      + disabled                  = false
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "vmy-etl-prod"
      + state                     = (known after apply)
      + workload_identity_pool_id = "github-pool"
    }

  # module.gh_oidc.google_iam_workload_identity_pool_provider.main will be created
  + resource "google_iam_workload_identity_pool_provider" "main" {
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.aud"        = "assertion.aud"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "Workload Identity Pool Provider managed by Terraform"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "vmy-etl-prod"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-pool"
      + workload_identity_pool_provider_id = "github-provider"

      + oidc {
          + allowed_audiences = []
          + issuer_uri        = "https://token.actions.githubusercontent.com"
        }
    }

  # module.gh_oidc.google_service_account_iam_member.wif-sa["terraform"] will be created
  + resource "google_service_account_iam_member" "wif-sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "projects/vmy-etl-prod/serviceAccounts/deploy@vmy-etl-prod.iam.gserviceaccount.com"
    }

  # module.iam.google_project_iam_member.custom_service_account["roles/bigquery.admin"] will be created
  + resource "google_project_iam_member" "custom_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "vmy-etl-prod"
      + role    = "roles/bigquery.admin"
    }

  # module.iam.google_project_iam_member.custom_service_account["roles/composer.admin"] will be created
  + resource "google_project_iam_member" "custom_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "vmy-etl-prod"
      + role    = "roles/composer.admin"
    }

  # module.iam.google_project_iam_member.custom_service_account["roles/composer.worker"] will be created
  + resource "google_project_iam_member" "custom_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "vmy-etl-prod"
      + role    = "roles/composer.worker"
    }

  # module.iam.google_project_iam_member.custom_service_account["roles/iam.workloadIdentityUser"] will be created
  + resource "google_project_iam_member" "custom_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "vmy-etl-prod"
      + role    = "roles/iam.workloadIdentityUser"
    }

  # module.iam.google_service_account.custom_service_account will be created
  + resource "google_service_account" "custom_service_account" {
      + account_id   = "custom-composer-sa"
      + disabled     = false
      + display_name = "composer-agent"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "vmy-etl-prod"
      + unique_id    = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + airflow_uri       = (known after apply)
  + composer_env_id   = (known after apply)
  + composer_env_name = "crime"
  + composer_sa       = (known after apply)
  + gcs_bucket_dags   = (known after apply)
  + gcs_bucket_data   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @vinceyordanov, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `PR-validation-workflow`*